Autodesk.Revit.DB.Structure.FabricSheet.PlaceInHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Inserts the single Fabric Sheet instance into the host element.
hostElement:
A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
transform defines the placement out of the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Creates a new instance of a single Fabric Sheet element within the project.
aDoc:
A document.
hostElement:
The element that will host the FabricSheet. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created single Fabric Sheet instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document aDoc does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.CutOverallWidth
The sheet width after cutting has taken place.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet
An object that represents an Fabric Sheet Element within the Autodesk Revit project.
Remarks:
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.
The Fabric Sheet element is available only in the Autodesk Revit Structure product.
Since:
2013